{
  "BuildNotificationsList": {
    "VerifyingBuildSystem": "Проверка системы сборки",
    "DownloadingFirmware": "Загрузка прошивки",
    "BuildingUserDefinesTXT": "Подготовка файла user_defines.txt",
    "CompilingFirmware": "Сборка прошивки",
    "FlashingDevice": "Прошивка устройства"
  },
  "BuildResponse": {
    "Error": "Ошибка",
    "GitDependencyError": "Ошибка зависимостей Git",
    "PythonDependencyError": "Ошибка зависимостей Python",
    "PlatformioDependencyError": "Ошибка зависимостей Platformio",
    "BuildError": "Ошибка сборки",
    "FlashError": "Ошибка прошивки",
    "TargetMismatch": "Выбранная прошивка не соответствует варианту прошивки на устройстве. Если вы уверены в своих действиях, поставьте галочку \"Прошить принудительно\"",
    "Success": "Успешно!",
    "ErrorDetails": "Произошла ошибка, обратитесь к приведённому выше журналу для получения точного сообщения об ошибке. Если вы еще не сделали этого, посетите <ExpresslrsLink>Expresslrs.org</ExpresslrsLink> и прочтите <FlashingGuideLink>Flashing Guide</FlashingGuideLink> для вашего конкретного устройства, а также <TroubleshootingGuideLink>Troubleshooting Guide</TroubleshootingGuideLink>. Если у вас всё ещё возникают проблемы после прочтения документации, пожалуйста, скопируйте вышеприведенные журналы сборки на сайт типа https://pastebin.com, опишите проблемы в канале #help-and-support на <ExpressLRSDiscordLink>ExpressLRS Discord</ExpressLRSDiscordLink> со ссылкой на журналы и другую соответствующую информацию, такую как название вашего устройства, используемый метод прошивки, и какие шаги вы уже предприняли для решения проблемы. Также имеется сайт ExpressLRS на русском языке: https://expresslrs.ru, и телеграм канал https://t.me/expresslrs_rus"
  },
  "DeviceOptionsForm": {
    "StandardMode": "Стандартный режим",
    "ManualMode": "Ручной режим",
    "CopyFromStandardMode": "Копировать из Стандартного режима",
    "LongerBuildTimeWarning": "При использовании режима ручного указания пользовательских определений кэширование бинарных файлов в облаке отключено, что приводит к гораздо более длительному времени сборки.",
    "RegulatoryDomainsISM": "Регуляторные домены частоты 2,4 ГГц",
    "RegulatoryDomains900": "Регуляторные домены частоты 900 МГц",
    "RegulatoryDomains433": "Регуляторные домены частоты 433 МГц",
    "BindingPhraseSetup": "Выбор бинд фразы",
    "CompatibilityOptions": "Параметры совместимости",
    "PerformanceOptions": "Параметры производительности",
    "ExtraData": "Дополнительные данные",
    "Network": "Сеть",
    "OtherOptions": "Другие параметры"
  },
  "DeviceTargetForm": {
    "UnverifiedHardwareTitle": "НЕПРОВЕРЕННОЕ УСТРОЙСТВО",
    "UnverifiedHardwareContent": "Производитель этого оборудования не предоставил разработчикам образцов для оценки и проверки, свяжитесь с ним для поддержки или продолжайте на свой страх и риск. Некоторые функции могут не работать.",
    "DeviceCategory": "Категория устройства",
    "Device": "Устройство"
  },
  "FirmwareVersionForm": {
    "OfficialReleases": "Официальные версии",
    "GitBranch": "Ветка Git",
    "GitCommit": "Коммит Git",
    "Local": "Локальный",
    "GitPullRequest": "Пулл реквест Git",
    "ShowPreRreleases": "Показывать предварительные версии",
    "Releases": "Версии",
    "ReleaseNotes": "Примечания к версии",
    "NewerVersionAvailable": "Доступна более новая версия прошивки",
    "UpgradeToV3": "ExpressLRS 2.X больше не поддерживается. Обновите до ExpressLRS 3.X.",
    "DangerZoneTitle": "ОПАСНАЯ ЗОНА",
    "DangerZoneContent": "Используйте эти исходники, только если вы знаете, что вы делаете или были проинструктированы разработчиками проекта",
    "GitBranches": "Ветки Git",
    "GitCommitHash": "Хэш коммита Git",
    "LocalPath": "Локальный путь",
    "AttentionTitle": "ВНИМАНИЕ!",
    "AttentionContent": "Вы пытаетесь прошить устаревшую специальную BetaFPV версию ExpressLRS. Оборудование BetaFPV полностью поддерживается в последних официальных версиях ExpressLRS. Мы рекомендуем использовать официальную прошивку, чтобы ExpressLRS работал наилучшим образом.",
    "ChooseFolder": "Выберите папку",
    "GitPullRequests": "Пулл реквесты Git"
  },
  "FlashingMethodDescription": {
    "BetaflightPassthroughDescription": "Этот метод позволяет прошить подключенный к полётному контроллеру приёмник с помощью функции passthrough контроллера.",
    "PlugInFCToComputer": "Подключите полётный контроллер к компьютеру, но ЗАКРОЙТЕ Betaflight конфигуратор.",
    "SelectDesiredDevice": "Выберите ниже желаемые параметры устройства и последовательный порт полётного контроллера.",
    "RunBuild&Flash": "Нажмите кнопки \"Собрать\" и \"Прошить\".",
    "BetaflightPassthroughWiki": "Самые свежие инструкции на нашей вики-странице.",
    "DFU": "Этот метод позволяет прошить приёмник или передатчик через режим обновления прошивки устройств (DFU режим).",
    "GeneralWiki": "Проверьте вики-страницу вашего конкретного устройства для получения дополнительной информации.",
    "STLink": "Этот метод позволяет прошить приёмник или передатчик с помощью программатора STLink, подключенного к устройству.",
    "StockBL": "Этот метод позволяет прошить приёмник или передатчик, используя загрузчик устройства.",
    "UART": "Этот метод позволяет прошить приёмник или передатчик через его USB-порт или подключив к нему FTDI-устройство (USB-UART адаптер).",
    "WIFI": "Этот метод создаёт файл прошивки, который вы можете загрузить на ваш приёмник или передатчик, подключившись к его встроенному WiFi.",
    "EdgeTxPassthrough": "Этот метод позволяет прошить подключенный к передатчику модуль, используя функцию passthrough EdgeTX.",
    "Passthrough": "Этот метод позволяет прошить подключенный к передатчику модуль, используя функцию passthrough.",
    "Zip": "Этот метод создает архив всех файлов, необходимых для вашего устройства."
  },
  "FlashingMethodOptions": {
    "FlashingMethod": "Метод прошивки"
  },
  "Header": {
    "ExpressLRSConfigurator": "Конфигуратор ExpressLRS",
    "DownloadNewestRelease": "Нажмите, чтобы скачать последнюю версию",
    "UpdateAvailable": "Доступно обновление!",
    "Documentation": "Документация",
    "Discord": "Discord",
    "FacebookGroup": "Группа в Facebook",
    "Github": "Github",
    "OpenCollective": "OpenCollective"
  },
  "SerialConnectionForm": {
    "SerialDevice": "Последовательное устройство",
    "BaudRate": "Скорость передачи данных",
    "Connect": "Подключиться"
  },
  "SerialDeviceSelect": {
    "ManualSelectionTitle": "Ручной выбор последовательного порта устройства",
    "ManualSelectionTitleTooltip": "Используйте ручной выбор последовательного порта, если автоматический выбор не позволяет выбрать правильный порт. В подавляющем большинстве случаев нет необходимости использовать этот вариант."
  },
  "Sidebar": {
    "Configurator": "Конфигуратор",
    "Backpack": "Backpack",
    "Logs": "Журналы",
    "SerialMonitor": "Монитор порта",
    "Settings": "Настройки",
    "Support": "Поддержка"
  },
  "UserDefineDescription": {
    "RegulatoryDomain915": "Обратитесь к <LoRaWANLink>LoRaWAN Frequency Plans and Regulations</LoRaWANLink> для выбора регуляторного домена в вашем местоположении.",
    "Wiki": "Самые свежие инструкции на нашей вики-странице.",
    "RegulatoryDomainISM2400": "Радиочастоты ISM являются частями радиоспектра, зарезервированными на международном уровне. Вы можете безопасно использовать этот регуляторный домен в любой стране.",
    "RegulatoryDomainEUCE2400": "Для прошивки версий ранее чем v3.x, регуляторный домен ЕС CE 2.4 ГГц ограничивает максимальную мощность, которая не требует LBT (Listen Before Talk), до 10 мВт. Для прошивки версий позже версии 3.x, регуляторный домен ЕС CE 2.4 ГГц ограничивает максимальную мощность до 100мВ и разрешает LBT (Listen Before Talk).",
    "BindingPhrase": "Бинд фраза связывает приёмники и передатчики без необходимости привязки вручную. Приёмники, прошитые без бинд фразы, потребуют традиционного способа привязки. Для подключения необходимо иметь одну и ту же фразу на приёмнике и передатчике. Придумайте запоминающееся слово, используя буквы латинского алфавита и цифры. Фраза - это не пароль и она не обеспечивает никакой безопасности, а просто уменьшает вероятность коллизий с другими пилотами.",
    "AutoWifiOnInterval": "<p>Это автоматически включит Wi-Fi для любого модуля, у которого есть ESP8285, если нет соединения через заданное количество секунд после загрузки, что позволяет обновлять прошивку при помощи подключения к сети Wi-Fi и посещения адреса 10.0.0.1</p><p>Интервал включения Wi-Fi устанавливается в <strong>секундах</strong>. По умолчанию 60 секунд.</p>",
    "TLMReportIntervalMs": "<p>Позволяет модулю посылать телеметрические данные в передатчик с фиксированным интервалом. Это уменьшает количество предупреждений「Телеметрия потеряна」при большом отношении телеметрии или низких частотах, таких как 50 Гц.</p><p>Значение по умолчанию <strong>240LU</strong>. Если вы хотите изменить значение, укажите его в миллисекундах и допишите <strong>LU</strong>. Например, для указания частоты обновления 100 мс необходимо ввести её следующим образом: <strong>100LU</strong>.</p><p>Обычно используется значение <strong>240LU</strong> для передатчиков на основе EdgeTX/OpenTX, и <strong>100LU</strong> для ErskyTx.</p>",
    "LockOnFirstConnection": "Блокировка режима работы (рейта). Когда приёмник ожидает соединения, он циклически перебирает все доступные режимы (rates) от F1000 до 50, ожидая соединения на каждом из них. По умолчанию ExpressLRS возвращается в этот режим после отключения (фейлсейва). Если используется LOCK_ON_FIRST_CONNECTION, ELRS не будет зацикливаться после отключения, а просто останется на том режиме, на котором было последнее соединение. Это делает восстановление соединения быстрым, потому что приёмник всегда ожидает подключения на правильном режиме.",
    "JustBeepOnce": "Если включить, модуль будет при запуске пищать один раз вместо стартовой мелодии.",
    "DisableStartupBeep": "Если включить, модуль не будет издавать никаких звуков при запуске.",
    "DisableAllBeeps": "Отключить все звуки.",
    "MyStartupMelody": "<p>Включите это для использования собственной стартовой мелодии с помощью синтаксиса BlHeli32. Необходимы параметры музыкальной строки и скорость, а смещение тона для переноса всей мелодии вверх или вниз на определенное количество полутонов является необязательным. Пример мелодий BlHeli32 доступен на <RoxWolfsYoutubeChannelLink>Youtube канале Rox Wolfs</RoxWolfsYoutubeChannelLink>, однако могут потребоваться некоторые эксперименты.</p><p>Чтобы научиться писать собственные мелодии, будет полезно посетить <SheetMusic101lLink>Sheet Music 101</SheetMusic101lLink> и <BLHeliPianoLink>BLHeli Piano</BLHeliPianoLink>.</p><p>Теперь эта опция также поддерживает мелодии в RTTTL формате. <EscTunesLink>EscTunes.com</EscTunesLink> - отличный ресурс для поиска новых мелодий.</p>",
    "UnlockHigherPower": "<p>Были сообщения о некоторых модулях R9M, нестабильно работающих при мощности >250 мВт с заводским охлаждением. Отчасти это связано с тем, что ELRS использует бОльшую скважность ШИМ по сравнению с заводскими прошивками. По умолчанию мощность ограничена 250 мВт. Вы можете разблокировать до 1000 мВт, включив этот параметр. Делайте это на свой страх и риск, если вы не делали никаких модификаций охлаждения.</p><p>Мы опубликовали <R9MFanModCoverLink>R9M Fan Mod Cover</R9MFanModCoverLink>, модифицированную крышку R9M для 3d печати с местом для вентилятора и дополнительного охлаждения, позволяющую использовать максимальную мощность (1-2 Вт в зависимости от мода).</p>",
    "UARTInverted": "Обеспечивает совместимость с передатчиками, имеющими инвертированный сигнал CRSF, такими как FrSky QX7, TBS Tango 2, RadioMaster TX16S. Этот параметр должен быть включен в большинстве случаев. Если у вас T8SG V2 или вы используете прошивку Deviation, выключите этот параметр.",
    "RCVRUARTBaud": "Скорость передачи данных UART приёмника. По умолчанию 420000. Установите эту опцию в 400000 и ваш приёмник будет работать с полетными контроллерами Kiss v1.",
    "RCVRInvertTX": "При использовании полётного контроллера, который имеет только выход RXI / SBUS (инвертированный RX), включите этот параметр, чтобы инвертировать выход CRSF от приёмника для использования этого выхода. Это не преобразует выход в SBUS, а инвертирует CRSF, поэтому в конфигураторе полётного контроллера для приёмника должен быть выбран протокол CRSF. Только для приёмников на ESP.",
    "UseR9MMR9MiniSBUS": "<p><strong>ЭТО НЕ ВКЛЮЧАЕТ ПРОТОКОЛ SBUS.</strong></p><p>Это полезно для полётных контроллеров F4, которые не имеют опции инверсии UART. Передача данных будет однонаправленнной, так что вы потеряете отправку телеметрии на ваш передатчик, а также возможность прошивки в режиме passthrough. Выход приёмника будет на контакте S.BUS на вашем R9MM/R9Mini. Возможно, также потребуется установка serialrx_inverted = ON в Betaflight конфигураторе для совместимости</p>",
    "HomeWifiSSID": "Задайте имя домашней сети Wi-Fi (SSID). Это позволит оборудованию при включении Wi-Fi автоматически подключаться к домашней сети.",
    "HomeWifiPassword": "Задайте пароль домашней сети Wi-Fi. Это позволит оборудованию при включении Wi-Fi автоматически подключаться к домашней сети.",
    "RxAsTx": "Прошейте приемник, включив эту опцию, и используйте его, как модуль передатчика."
  },
  "UserDefinesAdvisor": {
    "DisableUARTInvertedWarning": "Отключение UART_INVERTED используется редко. Пожалуйста, убедитесь, что передатчик поддерживает это."
  },
  "UserDefinesList": {
    "CustomBindingPhrase": "Пользовательская бинд фраза",
    "MyStartupMelody": "Стартовая мелодия",
    "Value": "Значение"
  },
  "WifiDeviceList": {
    "Name": "Имя",
    "Target": "Устройство",
    "Version": "Версия",
    "Type": "Тип",
    "DNS": "DNS",
    "IP": "IP",
    "Select": "Выбрать"
  },
  "WifiDeviceNotification": {
    "NewDevice": "Новое устройство",
    "Select": "Выбрать"
  },
  "WifiDeviceSelect": {
    "DefaultWifiIp": "По умолчанию (10.0.0.1)",
    "WifiDevices": "Устройства WiFi",
    "Manual": "Вручную",
    "WifiDeviceSelection": "Выбор устройства WiFi",
    "IPAddress": "IP адрес"
  },
  "Updater": {
    "FoundUpdates": "Найдены обновления",
    "UpdateNow": "Найдены обновления, хотите обновить сейчас?",
    "Sure": "Конечно",
    "Later": "Позже",
    "UpdateDownloading": "Загрузка обновлений",
    "NotifiedWhenReadyToInstall": "Обновление загружается, вы будете уведомлены, когда оно будет готово к установке.",
    "Restart": "Перезапуск",
    "ApplicationUpdate": "Обновление приложения",
    "Update": "Обновление",
    "ApplyUpdates": "Была загружена новая версия. Перезапустите приложение, чтобы применить обновления."
  },
  "ConfiguratorView": {
    "DownloadLUAScript": "Скачать Lua скрипт",
    "FirmwareVersion": "Версия прошивки",
    "Target": "Устройство",
    "Notice": "Примечание",
    "SelectFirmwareVersionFirst": "Сначала выберите версию прошивки.",
    "DeviceOptions": "Параметры устройства",
    "ResetDevice": "Сброс параметров прошивки устройства к рекомендуемым для этого оборудования, кроме бинд фразы.",
    "Reset": "Сброс",
    "Actions": "Действия",
    "FlashingOptions": "Параметры прошивки",
    "EraseBeforeFlash": "Стереть перед прошивкой",
    "ForceFlash": "Прошить принудительно",
    "Build": "Собрать",
    "Flash": "Прошить",
    "NetworkDevices": "Сетевые устройства",
    "DeviceSelectError": "Ошибка выбора устройства",
    "DeviceCouldNotBeAutomaticallySelected": "Устройство не может быть выбрано автоматически, это должно быть выполнено вручную.",
    "Close": "Закрыть",
    "Logs": "Журналы",
    "CopyLogToClipboard": "Скопировать журнал в буфер обмена",
    "SaveLogToFile": "Сохранить журнал в файл",
    "BuildsTakeMinutesFirstTime": "Иногда процесс сборки занимает не менее нескольких минут. Это нормально, особенно в первый раз.",
    "Result": "Результат",
    "Warning": "Внимание",
    "WaitForLEDBeforeDisconnectingPower": "Дождитесь возобновления мигания светодиода перед отключением питания",
    "UpdateLuaScript": "Обновить Lua скрипт",
    "UpdateLuaScriptOnRadio": "Не забудьте обновить Lua скрипт на вашем передатчике",
    "BuildNotice": "Примечания к сборке",
    "FirmwareOpenedInFileExplorer": "Бинарный файл прошивки был открыт в файловом обозревателе",
    "Back": "Назад",
    "FlashAnother": "Прошить ещё один",
    "Retry": "Повторить"
  },
  "LogsView": {
    "Logs": "Журналы",
    "OpenLogsFolder": "Открыть папку журналов"
  },
  "SerialMonitorView": {
    "SerialMonitor": "Монитор последовательного порта",
    "Disconnect": "Отключить"
  },
  "SettingsView": {
    "Settings": "Настройки",
    "LanguageSelector": "Выбор языка",
    "CurrentLanguage": "Текущий язык",
    "ExpertMode": "Режим эксперта",
    "ApplicationOptions": "Параметры приложения",
    "ExpertModeDescription": "Включите режим эксперта, чтобы разблокировать расширенные функции, включая дополнительные источники прошивки, возможность сборки прошивки с параметрами, заданными вручную и доступ к монитору последовательного порта для детальной диагностики."
  },
  "SupportView": {
    "Support": "Поддержка",
    "JoinTheCommunity": "Нужна помощь? Присоединяйтесь к сообществу!",
    "ExpressLRSDocumentation": "Документация ExpressLRS",
    "DiscordChat": "Чат Discord",
    "FacebookGroup": "Группа в Facebook",
    "Troubleshooting": "Решение проблем",
    "LegalDisclaimer": "Правовое заявление",
    "UseAtYourOwnRisk": "Для использования и эксплуатации этого типа устройства может потребоваться лицензия, и в некоторых странах его использование может быть запрещено. Соблюдение местных правил полностью возлагается на конечного пользователя. Это экспериментальное программное обеспечение/аппаратное обеспечение и нет гарантий стабильности или надежности. ИСПОЛЬЗУЙТЕ НА СВОЙ РИСК.",
    "CorruptedFirmwareFiles": "Повреждённые файлы прошивки",
    "YouCanManuallyClearAllFiles": "Если вы закроете Конфигуратор при загрузке git файлов прошивки, git репозиторий может быть поврежден. Вы можете вручную очистить все файлы и начать процесс сборки заново.",
    "ClearFirmwareFiles": "Очистить файлы прошивки",
    "CorruptedFirmwareFilesDeleted": "Поврежденные файлы прошивки были удалены и репозиторий git был очищен. Попробуйте запустить сборку заново.",
    "CorruptedPlatformioDependencies": "Поврежденные зависимости Platformio",
    "YouCanManuallyClearAllDependencies": "Если вы закроете Конфигуратор при загрузке git зависимостей platformio, репозиторий может быть поврежден. Вы можете вручную очистить все зависимости и начать процесс сборки заново.",
    "ClearPlatformioDependencies": "Очистить зависимости Platformio",
    "CorruptedPlatformioDependenciesDeleted": "Поврежденные зависимости Platformio были удалены и репозиторий git был очищен. Попробуйте запустить сборку заново."
  }
}
