{
  "BuildNotificationsList": {
    "VerifyingBuildSystem": "Перевірка системи збірки",
    "DownloadingFirmware": "Завантаження прошивки",
    "BuildingUserDefinesTXT": "Збірка user_defines.txt",
    "CompilingFirmware": "Компіляція прошивки",
    "FlashingDevice": "Прошивка пристрою"
  },
  "BuildResponse": {
    "Error": "Помилка",
    "GitDependencyError": "Помилка залежності Git",
    "PythonDependencyError": "Помилка залежності Python",
    "PlatformioDependencyError": "Помилка залежності PlatformIO",
    "BuildError": "Помилка збірки",
    "FlashError": "Помилка прошивки",
    "TargetMismatch": "Ціль з прошивки не збігається з ціллю, яка записана на пристрої. Якщо ви впевнені, що хочете це зробити, натисніть \"Прошити примусово\" нижче",
    "Success": "Успішно!",
    "ErrorDetails": "Сталася помилка, перегляньте наведений вище журнал для точного повідомлення про помилки. Якщо ви ще не зробили цього, відвідайте <ExpresslrsLink>Expresslrs.org</ExpresslrsLink> і прочитайте <FlashingGuideLink>Інструкції з прошивки</FlashingGuideLink> для вашого пристрою, а також <TroubleshootingGuideLink>Посібник з усунення несправностей</TroubleshootingGuideLink>. Якщо виникають питання після перегляду документації, будь ласка, скопіюйте журнал збірки, наведений вище, на сайт н-д https://paste.sh/ і розмістіть посилання у каналі #help-and-support на <ExpressLRSDiscordLink>ExpressLRS Діскорд</ExpressLRSDiscordLink> з посиланням до журналів та іншої відповідної інформації, такої як: модель пристрою, який спосіб встановлення ви використовували і які кроки ви вже зробили для вирішення цієї проблеми."
  },
  "DeviceOptionsForm": {
    "StandardMode": "Стандартний режим",
    "ManualMode": "Ручний режим",
    "CopyFromStandardMode": "Копіювати зі стандартного режиму",
    "LongerBuildTimeWarning": "При використанні встановленого користувачем ручного режиму, кеш хмарних бінарних файлів вимкнено, що призводить до набагато довшого часу на збірку.",
    "RegulatoryDomains": "Регуляторні домени",
    "BindingPhraseSetup": "Встановлення кодової фрази для з'єднання",
    "CompatibilityOptions": "Параметри сумісності",
    "PerformanceOptions": "Параметри продуктивності",
    "ExtraData": "Додаткові дані",
    "Network": "Мережа",
    "OtherOptions": "Інші налаштування"
  },
  "DeviceTargetForm": {
    "UnverifiedHardwareTitle": "НЕПЕРЕВІРЕНИЙ ПРИСТРІЙ",
    "UnverifiedHardwareContent": "Виробник цього обладнання не надав зразки розробникам для оцінювання та перевірки, зв'яжіться з ними для підтримки або продовжуйте на власний ризик. Не всі функції можуть працювати.",
    "DeviceCategory": "Категорія пристрою",
    "Device": "Пристрій"
  },
  "FirmwareVersionForm": {
    "OfficialReleases": "Офіційні версії",
    "GitBranch": "Гілка Git",
    "GitCommit": "Коміт Git",
    "Local": "Локальна",
    "GitPullRequest": "Git Запит на злиття",
    "ShowPreRreleases": "Відобразити пре-релізи",
    "Releases": "Релізи",
    "ReleaseNotes": "Список змін",
    "NewerVersionAvailable": "Існує новіша версія прошивки",
    "UpgradeToV3": "ExpressLRS 2.X більше не підтримується. Будь ласка, оновіться до ExpressLRS 3.X.",
    "DangerZoneTitle": "НЕБЕЗПЕЧНА ЗОНА",
    "DangerZoneContent": "Використовуйте цей вихідний код тільки якщо ви знаєте, що ви робите, або були проінструктовані розробниками проєкту",
    "GitBranches": "Гілки Git",
    "GitCommitHash": "Git хеш коміту",
    "LocalPath": "Локальний шлях",
    "AttentionTitle": "УВАГА",
    "AttentionContent": "Ви намагаєтеся прошити застарілий випуск BetaFPV з кастомного форку ExpressLRS. BetaFPV повністю підтримується в останніх офіційних випусках ExpressLRS. Ми рекомендуємо використовувати офіційну прошивку для отримання найкращого досвіду роботи з ExpressLRS.",
    "ChooseFolder": "Оберіть теку",
    "GitPullRequests": "Git запити на злиття"
  },
  "FlashingMethodDescription": {
    "BetaflightPassthroughDescription": "Цей спосіб дозволяє прошити ваш приймач, доки він підключений до польотного контролера за допомогою наскрізної функції прошивки польотного контролера - Passthrough.",
    "PlugInFCToComputer": "Під'єднайте ваш польотний контролер до вашого комп'ютера, але НЕ підключайтесь до конфігуратора Betaflight.",
    "SelectDesiredDevice": "Виберіть бажані Параметри Пристрою та послідовний пристрій вашого польотного контролера нижче.",
    "RunBuild&Flash": "Запустіть збірку та прошивку.",
    "BetaflightPassthroughWiki": "Перегляньте нашу вікі-сторінку з останніми визначеннями.",
    "DFU": "Цей метод дозволяє прошити приймач або передавач через режим прошивки пристрою (DFU - Device Firmware Upgrade Mode).",
    "GeneralWiki": "Перевірте вікі-сторінку для вашого конкретного пристрою для отримання додаткової інформації.",
    "STLink": "Цей метод дозволяє прошити приймач або передавач використовуючи програматор STLink, підключений до пристрою.",
    "StockBL": "Цей метод дозволяє блимати приймача або передавача, використовуючи завантажувач(bootloader) на пристрої.",
    "UART": "Цей метод дозволяє прошивати приймач або передавач через його USB порт або під'єднавши FTDI пристрій.",
    "WIFI": "Цей метод створює файл прошивки, який можна завантажити на ваш приймач або передавач, підключившись до його вбудованого WiFi.",
    "EdgeTxPassthrough": "Цей спосіб дозволяє прошити ваш модуль передавача, доки він підключений до передавача за допомогою функції наскрізної прошивки passthrough від EdgeTX.",
    "Passthrough": "Цей спосіб дозволяє прошити ваш модуль, доки він підключений до передавача за допомогою функції наскрізної прошивки passthrough."
  },
  "FlashingMethodOptions": {
    "FlashingMethod": "Метод прошивки"
  },
  "Header": {
    "ExpressLRSConfigurator": "ExpressLRS конфігуратор",
    "DownloadNewestRelease": "Натисніть, щоб завантажити найновіший реліз",
    "UpdateAvailable": "Доступне оновлення!",
    "Documentation": "Документація",
    "Discord": "Дискорд",
    "FacebookGroup": "Група у Facebook",
    "Github": "Github",
    "OpenCollective": "OpenCollective"
  },
  "SerialConnectionForm": {
    "SerialDevice": "Послідовний порт",
    "BaudRate": "Швидкість передачі даних",
    "Connect": "Під’єднатися"
  },
  "SerialDeviceSelect": {
    "ManualSelectionTitle": "Ручний вибір послідовного пристрою",
    "ManualSelectionTitleTooltip": "Використовувати ручне встановлення послідовного порту, якщо автоматичний не зміг вибрати правильний порт. У переважній більшості випадків нема потреби використовувати цю опцію."
  },
  "Sidebar": {
    "Configurator": "Конфігуратор",
    "Backpack": "Backpack",
    "Logs": "Журнали",
    "SerialMonitor": "Монітор послідовного порту",
    "Settings": "Налаштування",
    "Support": "Підтримка"
  },
  "UserDefineDescription": {
    "RegulatoryDomain915": "Зверніться до <LoRaWANLink>частотних планів та правил LoRaWAN</LoRaWANLink> та законодавчої бази вашого регіону.",
    "Wiki": "Перегляньте нашу вікі-сторінку з останніми визначеннями.",
    "RegulatoryDomainISM2400": "Діапазон ISM - це частини радіоспектру зарезервованого на міжнародному рівні. Цей домен можна безпечно використовувати в будь-якій країні.",
    "RegulatoryDomainEUCE2400": "Для версій прошивки до v3.x, ЄС CE 2.4 ГГц регуляторний домен обмежує максимальну потужність до 10 мВт, яка не потребує LBT (Listen Before Talk). Для версій прошивки після v3.x, регуляторний домен ЄС CE 2.4 ГГц обмежує максимальну потужність у 100 мВт та включає LBT (Listen Before Talk).",
    "BindingPhrase": "Однакова кодова фраза для з'єднання допомагає підключати приймачі до передавачів не вимагаючи прив'язки вручну. Приймачі, прошиті без кодової фрази, потребуватимуть з'єднання традиційним способом. І передавач, і приймач повинні мати однакову кодову фразу для з'єднання. Задайте щось легке для запам'ятовування і обмежте буквенно-цифровий вираз відповідно до латинського алфавіту. Це не пароль і не забезпечує жодної безпеки, кодова фраза знижує радіочастотні колізії з іншими пілотами.",
    "AutoWifiOnInterval": "<p>Це автоматично увімкне wifi для будь-якого модуля, який має ESP8285, якщо з'єднання з передавачем не відбулось після встановленої кількості секунд з моменту завантаження. Це дозволяє відправляти оновлення прошивки в приймач шляхом підключення до його мережі Wi-Fi та відкривання 10.0.0.1 в браузері</p><p>Інтервал автоматичного включення WiFi встановлюється в <strong>секундах</strong>. За замовчуванням - 60 секунд.</p>",
    "TLMReportIntervalMs": "<p>Змушує модуль передавача надсилати телеметричні дані каналу зв'язку на пульт через фіксований інтервал. Це зменшує кількість попереджень 「Втрата телеметрії」під час роботи з низькою відносною кількістю телеметрії або низькими частотами, наприклад 50 Гц.</p><p>Значення за замовчуванням становить <strong>240LU</strong>. Якщо ви хочете змінити це, вам потрібно додати до значення мілісекунд <strong>LU</strong>. Наприклад, щоб указати частоту оновлення телеметрії 100 мс, її потрібно ввести так: <strong>100LU</strong>.</p><p>Зазвичай потрібно зберегти <strong>240LU</strong> значення для передавачів на основі EdgeTX/OpenTX і <strong>100LU</strong> для передавачів ErskyTx.</p>",
    "LockOnFirstConnection": "Фіксація режиму приймача після успішного з'єднання - за замовчуванням приймач циклічно пробігає доступні радіочастотні режими з 5-секундними паузами, переходячи від найвищого до найнижчого режиму, намагаючись визначити режим передавача. Це дозволяє приймачу циклічно визначати режим передавача, але як тільки з’єднання було встановлено, приймач більше не буде циклічно перемикатися між режимами (доки не буде скинуто живлення).",
    "JustBeepOnce": "Передавач лише один раз пікне замість програвання мелодії при запуску.",
    "DisableStartupBeep": "Встановіть якщо треба, щоб передавач не видавав звуки при запуску.",
    "DisableAllBeeps": "Вимкнути всі звукові сигнали.",
    "MyStartupMelody": "<p>Використовуйте це, щоб вказати власну мелодію запуску за допомогою синтаксису BlHeli32. Параметри музичної строки і кількість ударів за хвилину є обов’язковими, тоді як опція зміщення півтонів є необов’язковою - вона використовується для зміщення всієї мелодії вгору або вниз на визначену кількість напівтонів. Приклади мелодій BlHeli32 доступні на <RoxWolfsYoutubeChannelLink>Youtube-каналі Rox Wolfs</RoxWolfsYoutubeChannelLink>, проте можуть знадобитися деякі експерименти.</p><p>Щоб написати власну мелодію, є <SheetMusic101lLink>Музика для початківців</SheetMusic101lLink> та <BLHeliPianoLink>BLHeli піаніно</BLHeliPianoLink> є корисними ресурсами.</p><p>Ця опція тепер також підтримує мелодії у форматі RTTTL. <EscTunesLink>EscTunes.com</EscTunesLink> – чудовий ресурс для відкриття нових мелодій.</p>",
    "UnlockHigherPower": "<p>Було кілька повідомлень про нестабільність модулів R9M при потужностях >250 мВт із базовим охолодженням. Це частково тому, що ELRS викликає більше навантаження для передачі порівняно зі стандартним мікропрограмним забезпеченням. За замовчуванням потужність обмежена 250 мВт. Ви можете розблокувати до 1000 мВт, увімкнувши наступну опцію. Робіть це на свій страх і ризик, якщо ви не покращуєте охолодження модуля.</p><p>Ми опублікували <R9MFanModCoverLink>R9M Fan Mod Cover</R9MFanModCoverLink>, спеціальну 3D-друковану задню панель із місцем для вентилятора та додатковим охолодженням, щоб забезпечити максимальну потужність (1-2 Вт в залежності від модифікації).</p>",
    "UARTInverted": "Забезпечує сумісність із пультами, які видають інвертований CRSF, такими як FrSky QX7, TBS Tango 2, RadioMaster TX16S. Ви схочете залишити це ввімкненим у більшості випадків. Якщо ваш пульт є T8SG V2 або ви використовуєте прошивку Deviation, вимкніть цю опцію.",
    "RCVRUARTBaud": "Швидкість передачі UART приймача. За замовчуванням 420000. Встановіть значення в 400000, і ваш приймач працюватиме з польотними контролерами Kiss v1.",
    "RCVRInvertTX": "Якщо використовується польотний контролер, який має лише інвертований контакт RXI / SBUS (RX inverted), увімкніть цю опцію, щоб інвертувати вихід CRSF із приймача і мати можливість використовувати цей контакт на платі. Це не перетворює вихідний сигнал у SBUS, сигнал лишається інвертованим CRSF, тому CRSF все одно має бути протоколом приймача, вибраним у програмному забезпеченні польотного контролера. Лише для приймачів на основі ESP.",
    "UseR9MMR9MiniSBUS": "<p><strong>ЦЕ НЕ УВІМКНЕ ПРОТОКОЛ SBUS.</strong></p><p>Це корисно для F4 польотних контролерів, які не мають опції неінвертованого UART. Зв'язок однонаправлений, тому ви втратите передачу телеметрії з дрону на пульт, а також можливість прошивки в наскрізному режимі passthrough. Сигнал буде виходити з контакту S.BUS за замовчуванням на вашому R9MM/R9Mini. Також може знадобитись поставити serialrx_inverted = ON в Betaflight для сумісності</p>",
    "HomeWifiSSID": "Встановлення назви домашньої Wi-Fi мережі (SSID). Це дозволить Wi-Fi під'єднуватись до домашньої мережі автоматично.",
    "HomeWifiPassword": "Пароль домашньої Wi-Fi мережі. Це дозволить Wi-Fi під'єднуватись до домашньої мережі автоматично."
  },
  "UserDefinesAdvisor": {
    "DisableUARTInvertedWarning": "Вимкнення UART_INVERTED є нетиповим. Будь ласка, переконайтеся, що ваш передавач підтримує це."
  },
  "UserDefinesList": {
    "CustomBindingPhrase": "Кодова фраза для з'єднання",
    "MyStartupMelody": "Особиста мелодія при запуску",
    "Value": "Значення"
  },
  "WifiDeviceList": {
    "Name": "Назва",
    "Target": "Цільовий пристрій",
    "Version": "Версія",
    "Type": "Тип",
    "DNS": "DNS",
    "IP": "IP-адреса",
    "Select": "Вибрати"
  },
  "WifiDeviceNotification": {
    "NewDevice": "Новий пристрій",
    "Select": "Вибрати"
  },
  "WifiDeviceSelect": {
    "DefaultWifiIp": "За замовчуванням (10.0.0.1)",
    "WifiDevices": "Wi-Fi пристрої",
    "Manual": "Вручну",
    "WifiDeviceSelection": "Вибір пристрою WiFi",
    "IPAddress": "IP-адреса"
  },
  "Updater": {
    "FoundUpdates": "Знайдено оновлення",
    "UpdateNow": "Знайдено оновлення, бажаєте оновити зараз?",
    "Sure": "Звісно",
    "Later": "Пізніше",
    "UpdateDownloading": "Оновлення завантажується",
    "NotifiedWhenReadyToInstall": "Оновлення завантажується, ви будете сповіщені, коли воно буде готове до встановлення.",
    "Restart": "Перезавантажити",
    "ApplicationUpdate": "Оновлення додатку",
    "Update": "Оновити",
    "ApplyUpdates": "Нову версію було завантажено. Перезапустіть додаток, щоб застосувати зміни."
  },
  "ConfiguratorView": {
    "DownloadLUAScript": "Завантажити сценарій LUA",
    "FirmwareVersion": "Версія прошивки",
    "Target": "Цільовий пристрій",
    "Notice": "Примітка",
    "SelectFirmwareVersionFirst": "Спочатку виберіть версію прошивки.",
    "DeviceOptions": "Параметри пристрою",
    "ResetDevice": "Скинути параметри пристрою до рекомендованих параметрів за замовчуванням на цьому цільовому пристрої. Окрім вашої кодової фрази для з'єднання (бінд-фрази).",
    "Reset": "Скинути",
    "Actions": "Дії",
    "FlashingOptions": "Параметри прошивки",
    "EraseBeforeFlash": "Стерти перед прошивкою",
    "ForceFlash": "Прошити примусово",
    "Build": "Зібрати",
    "Flash": "Прошити",
    "NetworkDevices": "Мережеві пристрої",
    "DeviceSelectError": "Помилка вибору пристрою",
    "DeviceCouldNotBeAutomaticallySelected": "Цільовий пристрій не може бути вибраний автоматично, це слід зробити вручну.",
    "Close": "Закрити",
    "Logs": "Журнали",
    "CopyLogToClipboard": "Скопіювати лог до буфера обміну",
    "SaveLogToFile": "Зберегти журнал в файл",
    "BuildsTakeMinutesFirstTime": "Іноді збірка триває як мінімум декілька хвилин. Це нормально, особливо коли ви збираєте вперше.",
    "Result": "Результат",
    "Warning": "Увага",
    "WaitForLEDBeforeDisconnectingPower": "Будь ласка, зачекайте доки світлодіод відновить блимання перед від'єднанням живлення",
    "UpdateLuaScript": "Оновити сценарій Lua",
    "UpdateLuaScriptOnRadio": "Обов'язково оновіть скрипт Lua на вашому пульті",
    "BuildNotice": "Повідомлення про збірку",
    "FirmwareOpenedInFileExplorer": "Бінарний файл з прошивкою був відкритий у файловому провіднику",
    "Back": "Назад",
    "Retry": "Повторити"
  },
  "LogsView": {
    "Logs": "Журнали",
    "OpenLogsFolder": "Відкрити теку з журналами"
  },
  "SerialMonitorView": {
    "SerialMonitor": "Монітор послідовного порту",
    "Disconnect": "Відключити"
  },
  "SettingsView": {
    "Settings": "Налаштування",
    "LanguageSelector": "Вибір мови",
    "CurrentLanguage": "Поточна мова"
  },
  "SupportView": {
    "Support": "Підтримка",
    "JoinTheCommunity": "Потрібна допомога? Збиті з пантелику? Приєднайтеся до спільноти!",
    "ExpressLRSDocumentation": "Документація ExpressLRS",
    "DiscordChat": "Чат в Discord",
    "FacebookGroup": "Група у Facebook",
    "Troubleshooting": "Усунення проблем",
    "LegalDisclaimer": "Відмова від відповідальності",
    "UseAtYourOwnRisk": "Використання даного типу пристрою може вимагати наявності ліцензії, а деякі країни можуть заборонити його використання. Відповідальність за дотримання локальних законів і правил лежить на кінцевому користувачі. Це експериментальне програмне / апаратне забезпечення і немає гарантії стабільності або надійності. ВИКОРИСТОВУЙТЕ НА ВЛАСНИЙ РИЗИК.",
    "CorruptedFirmwareFiles": "Пошкоджені файли прошивки",
    "YouCanManuallyClearAllFiles": "Якщо ви закриєте конфігуратор в той час, коли git завантажує файли прошивок, репозиторій git може бути пошкоджено. Ви можете вручну очистити всі файли й запустити процес збірки знову.",
    "ClearFirmwareFiles": "Очистити файли прошивки",
    "CorruptedFirmwareFilesDeleted": "Пошкоджений файл прошивки було видалено і git репозиторій було очищено. Спробуйте зібрати ще раз.",
    "CorruptedPlatformioDependencies": "Пошкоджені залежності platformio",
    "YouCanManuallyClearAllDependencies": "Якщо ви закриєте конфігуратор в той час, коли platformio завантажує залежності, репозиторій git може бути пошкоджено. Ви можете вручну очистити всі залежності й запустити процес збірки знову.",
    "ClearPlatformioDependencies": "Очистити залежності platformio",
    "CorruptedPlatformioDependenciesDeleted": "Пошкоджені залежності platformio було видалено і git репозиторій було очищено. Спробуйте зібрати ще раз."
  }
}
